do


function run(msg, matches)
  local help = [[🤖دستورات فارسی ربات
☑️ربات روشن

✔️فعال کردن بوت در يک گروه خواص

🔋ربات خاموش

✔️غير فعال کردن بوت در يک گروه خواض

❌پلاگین ها

✔️مشاهده ليست پلاگين ها

🚀پلاگین بشه (نام پلاگین به انگلیسی)

✔️فعال کردن پلاگيني با نام (plugin name)

❤️پلاگین پاک شه (نام پلاگین به انگلیسی)

✔️غير فعال کردن پلاگيني با نام (plugin name)

🔘پلاگین ها ریلود

✔️آپديت کردن ليست پلاگين ها

⭕️اضافه کردن پلاگین (متن) (نام)

✔️اضافه کردن پلاگيني به محتواي (متن)و نام (نام) به ليست پلاگين 

❗️گرفتن پلاگین (نام به انگلیسی)

✔️ارسال پلاگين با نام (نام انگلیسی)

⚫️تغییر نام (نام)

✔️تغيیر نام گروه به (نام)

🔶لینک

✔️دريافت لينک گروه در پيوي

🌐لینک جدید

✔️ساخت لينک جديد

🔷سوپرش کن

✔️تبديل گروه معمولي به سوپر گوه

♦️شرح جدید (متن)

✔️تغير شرح گروه به (متن)

🔇اخراج (آیدی) یا ریپلای

✔️اخراج فردي با آيدي @username (حتي با ريپلاي)

✔️اضافه کردن (آیدی) یا ریپلای

✔️ادد کردن فردي با آيدي @username به گروه (حتي با ريپلاي)

⚠️آیدی (آیدی فرد) یا ریپلای

✔️دريافت آيدي عددي فردي با آيدي @username (حتي با ريپلاي)

💢آیدی گپ

✔️دريافت آيدي گروه

🔈صدا (متن)

✔️تبديل (متن) به صدا

👁‍🗨اضافه کردن (متن) (متن2)

✔️سيو شدن (متن2) در جواب (متن)

🔹زدن (متن)

✔️ارسال متن سيو شده براي (متن) يعني (متن2)

آب و هوای (شهر)

دريافت اطلاعات آب و هواي شهر (شهر)

🔻استیکر (متن)

✔️تبديل (متن) به استيکر
.......................................
🤘😎
- @decopaje
.......................................]]
if matches[1] == 'راهنما' and is_sudo(msg) then
send_large_msg("user#id"..msg.from.id, help)
 return '🤖 راهنمای ربات به پیوی شما ارسال شد 🔴☑️ '
  end

end
return {
 patterns = {
  "^(راهنما)$"
  },
  run = run
}
end
